Revit 2026 API

# ControlledApplicationDocumentChanged Event

---

Subscribe to the FailuresProcessingEvent event to be notified when Revit document has changed.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<DocumentChangedEventArgs> DocumentChanged
```
```vb
Public Event DocumentChanged As EventHandler(Of DocumentChangedEventArgs)
```
```cpp
public:
 event EventHandler<DocumentChangedEventArgs^>^ DocumentChanged {
	void add (EventHandler<DocumentChangedEventArgs^>^ value);
	void remove (EventHandler<DocumentChangedEventArgs^>^ value);
}
```
```fsharp
member DocumentChanged : IEvent<EventHandler<DocumentChangedEventArgs>,
    DocumentChangedEventArgs>
```

#### Value

EventHandlerDocumentChangedEventArgs

This event is raised whenever a Revit transaction is either committed, or undone or redone. This is a read-only event, designed to allow you to keep external data in sync with the state of the Revit database. To update the Revit database in response to changes in elements, use the IUpdater framework.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace